Model: "TDNN"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 1, 28, 28)    0
__________________________________________________________________________________________________
Firstlayer (Conv2D)             (None, 1, 28, 1)     113         input_1[0][0]
__________________________________________________________________________________________________
Secondlayer (Conv2D)            (None, 1, 14, 64)    320         Firstlayer[0][0]
__________________________________________________________________________________________________
Thirdlayer (Conv2D)             (None, 1, 14, 64)    36928       Secondlayer[0][0]
__________________________________________________________________________________________________
Fourthlayer (Conv2D)            (None, 1, 14, 64)    36928       Thirdlayer[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 896)          0           Fourthlayer[0][0]
__________________________________________________________________________________________________
hiddenlayer (Dense)             (None, 128)          114816      flatten_1[0][0]
__________________________________________________________________________________________________
Z_1 (Dense)                     (None, 6)            774         hiddenlayer[0][0]
__________________________________________________________________________________________________
Z_2 (Dense)                     (None, 6)            774         hiddenlayer[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 6)            0           Z_1[0][0]
                                                                 Z_2[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 128)          896         lambda_1[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 12544)        1618176     dense_1[0][0]
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 14, 14, 64)   0           dense_2[0][0]
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 14, 14, 64)   36928       reshape_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 14, 14, 64)   36928       conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 29, 29, 64)   36928       conv2d_transpose_2[0][0]
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 28, 28, 1)    257         conv2d_transpose_3[0][0]
==================================================================================================
Total params: 1,920,766
Trainable params: 1,920,766
Non-trainable params: 0